Repository: pigamux/pigamux.github.io
Catalog: games/aca/AdventuresWithAnxiety.tmx
Source language: en_us
Languages: pt_pt

source: I'm a battered shelter dog!
pt_pt: b: Eu sou um cão de canil maltratado.

source: Battered dogs poop on your bed sometimes!
pt_pt: Cães maltratados fazem cocô na tua cama às vezes!

source: b: But if you're patient with me... and just stay and sit with me...
pt_pt: b: Mas se fores paciente comigo... e te "sentares" comigo...

source: b: Maybe you can tame this wolf.
pt_pt: b: Talvez possas domar este Lobo.

source: <g id="1">Good dog.</g>
pt_pt: <g id="1">Cão lindo.</g>

source: <g id="1">Good human.</g>
pt_pt: <g id="1">Humano lindo.</g>

source: {{if _.fifteencigs}} b: AAAAA YOU'RE STILL EATING ALONE FIFTEEN CIGARETTES AAAAA {{/if}}
pt_pt: {{if _.fifteencigs}} b: AAAAA AINDA ESTÁS A COMER SOZINHO QUINZE CIGARROS AAAAA {{/if}}

source: {{if _.parasite}} b: AAAAA YOU'RE STILL NOT PRODUCTIVE WHILE EATING WE'RE SOCIETY-PARASITES AAAAA {{/if}}
pt_pt: {{if _.parasite}} b: AAAAA AINDA NÃO FOSTE PRODUTIVO ENQUANTO COMÍAMOS, SOMOS PARASITAS DA SOCIEDADE AAAAA {{/if}}

source: {{if _.whitebread}} b: AAAAA YOU'RE EATING MORE WHITE BREAD AAAAA {{/if}}
pt_pt: {{if _.whitebread}} b: AAAAA ESTÁS A COMER MAIS PÃO BRANCO AAAAA {{/if}}

source: s: But did you <g id="1">see</g> that "news story" about that horrible thing happening somewhere?
pt_pt: s: Mas <g id="1">viste</g> aquela "notícia" sobre aquela coisa horrível que aconteceu naquele lugar?

source: h2: h-hi...
pt_pt: h2: O-olá...

source: a: God I hate the news.
pt_pt: a: Deus, odeio as notícias.

source: It's all sensationalism and clickbait.
pt_pt: É tudo sensacionalismo e clickbait.

source: h2: n... nice party...
pt_pt: h2: B-bela festa...

source: s: True, but they're just following incentives.
pt_pt: s: Verdade, mas eles estão só a seguir incentivos.

source: The <g id="1">real</g> problem is people who click the clickbait.
pt_pt: O <g id="1">verdadeiro</g> problema são as pessoas que clicam no clickbait.

source: s: Who would retweet a terrible news story, and make all their friends feel bad?
pt_pt: s: Quem daria um retweet a uma notícia terrível e faria todos os seus amigos sentirem-se mal?

source: a: Ugh, I know right?
pt_pt: a: Ugh, eu sei, certo?

source: s: But did you <g id="1">see</g> that "news story" going viral?
pt_pt: s: Mas <g id="1">viste</g> aquela "notícia" que se tornou viral?

source: a: Yeah, totally fake.
pt_pt: a: Sim, totalmente falso.

source: Who would fall for that and retweet it?
pt_pt: Quem cairia nessa e daria retweet?

source: s: Seriously dude.
pt_pt: s: A sério pá.

source: Like, hello, open up Google and factcheck first?
pt_pt: Tipo, olá, abram o Google e verifiquem os factos primeiro?

source: s: Like I was saying, the Meme Industrial Complex exploits cats.
pt_pt: s: Como estava a dizer, o Complexo Industrial dos Memes explora gatos.

source: a: Elaborate on this thesis.
pt_pt: a: Elabora lá isso.

source: s: Well, I saw someone retweet a GIF of a cat drinking milk yesterday.
pt_pt: s: Bem, eu vi alguém a dar retweet a um GIF de um gato a beber leite ontem.

source: s: They can't digest that ^crap^!
pt_pt: s: Eles não conseguem digerir essa ^ merda ^!

source: Who would retweet <g id="1">animal abuse</g> like that?
pt_pt: Quem dao aria retweet a <g id="1">um abuso animal</g> assim?

source: s: So yeah they never replied back!
pt_pt: s: Então, ya, eles nunca me responderam!

source: a: Even though you both matched each other on Tinder?
pt_pt: a: Mesmo que vocês tenham dado match no Tinder?

source: s: Yeah I dunno!
pt_pt: s: Sim, sei lá!

source: What, did they think I was a <g id="1">serial killer</g> or something?
pt_pt: Mas o quê, eles pensaram que eu era um <g id="1">assassino em série</g> ou assim?

source: So paranoid.
pt_pt: Tão paranoico.

source: Maybe they think hookups can't fill the hole in their heart?
pt_pt: Talvez pensem que engates não servem para preencher o vazio nos corações?

source: s: Stop being such a prude!
pt_pt: s: Para de ser tão puritano!

source: Open your mind, then open your legs!
pt_pt: Abre a tua mente, depois abre as tuas pernas!

source: They weren't that hot, but they would have been a nice catch!
pt_pt: Não eram assim tão bons, mas teriam sido um bom match!

source: a: Gotta Catch 'Em All!
pt_pt: a: Tenho de os ter a todos!

source: n: ROUND TWO: <g id="1">FIGHT!</g>
pt_pt: n: SEGUNDA RONDA: <g id="1">LUTA!</g>

source: Oh no they all hate us!
pt_pt: Oh não, todos nos odeiam!

source: Were you <g id="2">ogling</g> the redhead?
pt_pt: Estás <g id="2">interessadx</g> na ruiva?

source: Hey, let's talk about the meaning of life.
pt_pt: Ei, vamos falar sobre o significado da vida.

source: b: We're bringing down the mood of this party by being such a sad lump!
pt_pt: b: Estamos a deixar todos de mau humor por sermos tão coitadinhos!

source: b: We're killing the good vibes!
pt_pt: b: Estamos a arruinar as boas vibes!

source: We're committing first-degree vibe-murder!
pt_pt: Estamos a cometer um homicídio de vibes em primeiro grau!

source: b: Human, we have to leave <g id="1">now</g> before--
pt_pt: b: Humano, temos de bazar antes <g id="1"></g> que--

source: b: They're more attractive than us, which means if we even <g id="1">look</g> at them, then--
pt_pt: b: Eles são mais atraentes que nós, o que significa que mesmo se <g id="1">olharmos para</g> eles, então -

source: b: WE'RE CREEPS
pt_pt: b: SOMOS UNS TARADOS

source: b: We're creepy, evil, bad bad bad terrible terrible perv--
pt_pt: b: Nós somos tarados, maus, maus, maus, terríveis, pervertidos

source: b: At the end of it all, what can we possibly do that really matters?
pt_pt: b: No final de tudo, o que podemos fazer que realmente importe?

source: b: Contribute to humanity?
pt_pt: b: Contribuir para a humanidade?

source: All great works decay the way of Ozymandias.
pt_pt: Todas as grandes obras decompõem o caminho de Ozymandias.

source: Love?
pt_pt: Amor?

source: Death will always do it part.
pt_pt: A morte fará sempre parte.

source: b: And how much death there is!
pt_pt: b: E quanta morte existe!

source: <g id="1">We</g> will die.
pt_pt: <g id="1">Nós</g> vamos morrer.

source: <g id="2">Our loved ones</g> will die.
pt_pt: <g id="2">Os nossos entes queridos</g> vão morrer.

source: b: Heck, the Second Law of Thermodynamics means even our <g id="1">universe</g> will die!
pt_pt: b: ^Caralho^, a Segunda Lei da Termodinâmica diz que até o nosso <g id="1">universo</g> vai morrer!

source: b: Oh, "death makes us appreciate life"?
pt_pt: b: Ah, "a morte faz-nos valorizar a vida"?

source: That's like saying slavery is good because it makes us appreciate freedom!
pt_pt: Isso é como dizer que a escravidão é boa porque nos faz valorizar a liberdade!

source: b: Oh, "you need to make your own meaning"?
pt_pt: b: Oh, "precisas de criar o teu próprio significado"?

source: That's what cultists and conspiracy theorists do!
pt_pt: Isso é o que os cultistas e os conspiracionistas fazem!

source: b: Life has no meaning, death has no meaning, even <g id="1">meaning</g> has no meaning!
pt_pt: b: A vida não tem sentido, a morte não tem sentido, mesmo <g id="1">o sentido</g> não tem sentido!

source: What is a mortal soul supposed to--
pt_pt: O que é uma alma mortal deve faz-

source: b: Um... can you hear me, human?
pt_pt: b: Hum... consegues ouvir-me, humano?

source: b: <g id="1">GASP</g>
pt_pt: b: <g id="1">SUSPIRO</g>

source: b: I MUST WARN YOU ABOUT...
pt_pt: b: TENHO DE AVISAR-TE ACERCA...

source: <g id="2">More</g> of the same danger!
pt_pt: <g id="2">Mais</g> do mesmo perigo!

source: {{if _.a2_first_danger=="social"}} <g id="1">A <g id="2">different</g> social danger!</g>
pt_pt: {{if _.a2_first_danger=="social"}} <g id="1">Um perigo social <g id="2">diferente</g>!</g>

source: {{if _.a2_first_danger=="perv" || _.a2_first_danger=="meaning"}} <g id="1">A <g id="2">different</g> moral danger!</g>
pt_pt: {{if _.a2_first_danger=="perv" || _.a2_first_danger=="meaning"}} <g id="1">Um perigo moral <g id="2">diferente</g>!</g>

source: You're ignoring danger!
pt_pt: Estás a ignorar o perigo!

source: That's dangerous!
pt_pt: Isso é perigoso!

source: b: EMOTIONS ARE CONTAGIOUS!
pt_pt: b: AS EMOÇÕES SÃO CONTAGIOSAS!

source: SO IF YOU DON'T LEAVE YOU'LL INFECT EVERYONE WITH YOUR MENTAL ILLNESS!
pt_pt: POR ISSO, SE NÃO FORES EMBORA, VAIS CONTAGIAR TODA A GENTE COM A TUA DOENÇA MENTAL!

source: b: You'll create a deadly outbreak of SAD LUMP SYNDROME
pt_pt: b: Vais criar um surto mortal de SÍMDROME DE COITADINHO

source: b: We need to get out of here and quarantine ourselves forever in a small room with Netflix and food delivery!
pt_pt: b: Precisamos de sair daqui ficar em quarentena para sempre numa sala com Netflix e take-out!

source: b: DON'T BE A CREEP.
pt_pt: b: NÃO SEJAS TARADO.

source: IT'S AGAINST THE LAW!
pt_pt: É CONTRA A LEI!

source: b: Creep Law, Section 74.5: (1) Any Person who checks out (a) those muscular shoulders (b) that bubble booty (2) shall be hereby known as
pt_pt: b: Lei dos Tarados, Secção 74.5: (1) Aquele que apreciar (a) aqueles ombros musculosos (b) aquele rabo redondo (2) será conhecido como

source: b: "A BIG DISGUSTING TRASH PERVERT"
pt_pt: b: "UM TARADO NOJENTO"

source: b: Actually, even if you find a noble purpose in life, you can <g id="1">still</g> mess everything up!
pt_pt: b: Na verdade, mesmo que encontres um propósito nobre na vida, <g id="1">ainda</g> podes estragar tudo!

source: b: Alfred Nobel wanted world peace and for cultures to understand each other.
pt_pt: b: Alfred Nobel queria paz mundial e que as culturas se entendessem.

source: So he decided to make travel easier.
pt_pt: Então, decidiu tornar o viajar mais fácil.

source: b: So he needed a way to cheaply create train tunnels.
pt_pt: b: Então, precisava de uma maneira barata de criar túneis para comboios.

source: So he invented a new material called "dynamite"...
pt_pt: Então, inventou um material novo chamado "dinamite"...

source: b: which was used in World War I to KILL MILLIONS OF PEOPLE
pt_pt: b: que foi usado na Primeira Guerra Mundial para MATAR MILHÕES DE PESSOAS

source: b: IT'S THE BUTTERFLY EFFECT, HUMAN!
pt_pt: b: É O EFEITO BORBOLETA, HUMANO!

source: HOW MANY PEOPLE ARE YOU ACCIDENTALLY KILLING RIGHT NOW
pt_pt: QUANTAS PESSOAS ESTÁS A MATAR ACIDENTALMENTE AGORA

source: b: Actually, you know what's worse than no-one liking you?
pt_pt: b: Na verdade, sabes o que é pior do que ninguém gostar de ti?

source: <g id="1">Everyone</g> liking you.
pt_pt: <g id="1">Todos</g> gostarem de ti.

source: b: That is, becoming one of <g id="1">these</g> pleasure-chasing party animals.
pt_pt: b: Isto é, tornares-te alguém que só <g id="1">procura</g> festa e prazer.

source: b: A shallow life with shallow friends who only know the shallow you!
pt_pt: b: Uma vida superficial com amigos superficiais que só te conhecem superficialmente!

source: b: Human, we need to run away from these pleasure-zombies before they turn us into one of them!
pt_pt: b: Humano, precisamos de fugir desses zombies do prazer antes que eles nos transformem num deles!

source: b: People are dying in famines and genocides <g id="1">right now</g> and we're just partying!
pt_pt: b: Há pessoas a morrer de fome e <g id="1">genocídio</g> e nós estamos numa festa!

source: b: A wise person once said, "the only thing necessary for the triumph of evil is for good folks to do nothing."
pt_pt: b: Uma pessoa sábia uma vez disse: "a única coisa necessária para o triunfo do mal é que as pessoas boas não façam nada."

source: b: WE'RE DOING NOTHING.
pt_pt: b: NÃO ESTAMOS A FAZER NADA.

source: b: BY PARTYING, WE'RE HELPING <g id="1">HITLER</g>.
pt_pt: b: AO ESTAR NESTA FESTA, ESTAMOS A AJUDAR O <g id="1">HITLER</g>.

source: b: You think you're safe just because you took the batteries out of the carbon monoxide detector?
pt_pt: b: Achas que estás seguro só porque tiraste as baterias do detetor de monóxido de carbono?

source: b: You won't even smell the poison!
pt_pt: b: Nem vais sentir o cheiro do veneno!

source: You'll just get sleepy and then you'll--
pt_pt: Vais só ficar com sono e depois mo--

source: b: DIEEEEEEEEEEEEEEEEEE
pt_pt: b: MORREEEEEEEEEEEEERRRRRRRRRR

source: b: Oh thank goodness human, I think you can hear me again!
pt_pt: b: Graças a Deus humano, acho que já me consegues ouvir!

source: b: I SHALL WARN YOU ABOUT...
pt_pt: b: TENHO DE TE AVISAR ACERCA...

source: {{if _.a2_first_choice=="louder"}} <g id="1"><g id="2">Even more</g> of the same danger!</g>
pt_pt: {{if _.a2_first_choice=="louder"}} <g id="1"><g id="2">Ainda mais</g> do mesmo perigo!</g>

source: {{if _.a2_first_choice!="louder"}} <g id="1"><g id="2">More</g> of the same danger!</g>
pt_pt: {{if _.a2_first_choice!="louder"}} <g id="1"><g id="2">Mais</g> do mesmo perigo!</g>

source: Did you check that punch before drinking?
pt_pt: Analisaste o ponche antes de beber?

source: b: Actually, Netflix & food delivery isn't quarantined enough!
pt_pt: b: Na verdade, Netflix e take-out não é quarentena suficiente!

source: We'd still infect the delivery person!
pt_pt: Ainda assim infetaríamos o entregador!

source: b: We need to move to the Canadian Yukon territories, and have our food delivered by drone!
pt_pt: b: Precisamos de nos mudar para os territórios canadenses de Yukon e ter a nossa comida entregue por um drone!

source: b: And then they'd have to sterilize the drone to rid it of our SAD LUMP GERMS
pt_pt: b: Mas assim teriam que esterilizar o drone para livrá-lo dos nossos GERMES DE COITADINHOS

source: b: The BIG DISGUSTING TRASH PERVERT shall be sentenced to 72 hours in one of those medieval public-humiliation devices
pt_pt: b: O TARADO será sentenciado a 72 horas num daqueles dispositivos medievais de humilhação pública

source: b: unless they're secretly <g id="1">into</g> that sort of thing
pt_pt: b: a menos que esteja secretamente <g id="1">interessado</g> nesse tipo de coisa

source: b: because they're a BIG DISGUSTING TRASH PERVERT
pt_pt: b: porque são um tarado nojento

source: b: BUTTERFLY EFFECT!
pt_pt: b: EFEITO BORBOLETA!

source: You're using a non-biodegradable plastic cup?
pt_pt: Estás a usar um copo de plástico não biodegradável?

source: b: BAM, A LANDFILL LEAKS POISON AND KILLS A KID
pt_pt: b: BAAM, UM ATERRO VAZ VENENO E MATA UMA CRIANÇA

source: b: You're sweating and your heart's pounding?
pt_pt: b: Estás a suar e o teu coração está a bater mais forte?

source: b: BAM, YOU BANKRUPT OUR HEALTHCARE SYSTEM AND MILLIONS DIE
pt_pt: b: BAAM, LEVASTE O NOSSO SISTEMA DE SAÚDE À FALÊNCIA E MILHÕES MORRERAM

source: b: These pleasure-zombies will stumble towards you mumbling,
pt_pt: b: Estes zombies do prazer vão tropeçar na tua direção a resmungar,

source: b: LIIIIIKES.
pt_pt: b: GOSTOOOOOS.

source: LIIIIIIIIIIKES.
pt_pt: GOSTOOOS.

source: b: Then they'll BITE YOU and turn you into a BRAINLESS BRO and/or THOUGHTLESS THOT!
pt_pt: b: Depois vão MORDER-TE e transformar-te num MANO SEM CÉREBRO / ou numa VADIA FRAQUINHA!

source: b: THE NAZIS ARE GOOSE-STEPPING BACK ON THE STREETS RIGHT NOW
pt_pt: b: OS NAZIS ESTÃO A VOLTAR ÀS RUAS NESTE MOMENTO

source: b: Saying, <g id="1">good thing those 'good folks' slacked off with stuff like 'relaxing' and 'self-care'!</g>
pt_pt: b: <g id="1">Ainda bem que essa 'Boa Gente' se descuidou com coisas como 'relaxar' e 'cuidar de si'!</g>

source: b: <g id="1">Now our plans can go fourth, reich on schedule!</g>
pt_pt: b: <g id="1">Agora os nossos planos podem ficar em quarto lugar!</g>

source: b: Come to think about it, do we know if this building <g id="1">has</g> a monoxide detector?!
pt_pt: b: Pensando bem, sabemos se este prédio <g id="1">tem</g> um detetor de monóxido?!

source: b: What if we're all being poisoned <g id="1">RIGHT NOW?</g>
pt_pt: b: E se estivermos a ser envenenados <g id="1">NESTE MOMENTO?</g>

source: b: WE WOULDN'T EVEN SEE DEATH APPROACH.
pt_pt: b: NEM ÍAMOS VER A MORTE A CHEGAR.

source: WE'D JUST STOP EXISTING FOREVER AND EVER AND EV--
pt_pt: ÍAMOS SIMPLESMENTE DEIXAR DE EXISTIR PARA SEMPR--

source: b: What if we're just <g id="1">fundamentally incapable</g> of ever being loved, or loving another?
pt_pt: b: E se formos <g id="1">fundamentalmente incapazes</g> de ser amados ou de amar outra pessoa?

source: b: What if something irreversibly broke inside of us a long time ago?
pt_pt: b: E se algo partiu irreversivelmente dentro de nós há muito tempo?

source: Or never existed in us in the first place?
pt_pt: Ou nunca sequer existiu em nós em primeiro lugar?

source: b: AHH WE'RE BROKEN!
pt_pt: b: AHH ESTAMOS ESTRAGADOS!

source: SO BROKEN SO BROKEN SO BROKE--
pt_pt: TÃO ESTRAGADOS TÃO ESTRAGADOS TÃO ESTR-

source: b: What if we're just <g id="1">fundamentally rotten?</g>
pt_pt: b: E se estivermos <g id="1">fundamentalmente podres?</g>

source: b: Others have an inner drive to do goodness, but we only do "good" out of guilt or shame, if at all.
pt_pt: b: Outros têm um impulso interior para fazer o bem, mas nós só fazemos o "bem" por culpa ou vergonha, se tanto.

source: b: What if it's in our nature to hurt others?
pt_pt: b: E se for da nossa natureza magoar os outros?

source: What if we can't be anything <g id="1">other</g> than a burden to those close to us?
pt_pt: E se não conseguirmos ser mais <g id="1">que</g> um fardo para quem nos é próximo?

source: b: I'm not being irrational.
pt_pt: b: Não estou a ser irracional.

source: People <g id="1">do</g> drug punch bowls.
pt_pt: As pessoas <g id="1">fazem</g> canecas de ponche com droga.

source: That is an actual thing that actually happens.
pt_pt: É algo real que realmente acontece.

source: b: Human, does your head hurt?
pt_pt: b: Humano, dói-te a cabeça?

source: Are your limbs limp?
pt_pt: Custa-te mexer?

source: I think we're dying.
pt_pt: Acho que estamos a morrer.

source: b: AHHH WE'RE DYING!
pt_pt: b: AHHH ESTAMOS A MORRER!

source: WE'RE DYING WE'RE DYING WE'RE DYI--
pt_pt: ESTAMOS A MORRER ESTAMOS A MO--

source: h: F^AAACK^!
pt_pt: h: M^EEERDA^!

source: h: F^ACK^ING F^ACK^-F^AKK^ITY <g id="1">F^AAAAACK^</g>
pt_pt: h: MER^RRRR^DAA MER<g id="1">^RRRRDAA^</g>

source: b: Yay, human!
pt_pt: b: Yey, humano!

source: I'm so happy you can hear me again!
pt_pt: Estou tão feliz por me conseguires ouvir!

source: b: Why were you ignoring me?
pt_pt: b: Porque é que me estás a ignorar?

source: h: Holy ^hell^, you absolute moron.
pt_pt: h: Deus me livre, seu grande parvo.

source: h: You know that Native American story?
pt_pt: h: Conheces aquela história do nativo americano?

source: h: "There are two wolves inside you, one is hope, one is despair, which wolf wins?
pt_pt: h: "Existem dois lobos dentro de ti, um é a esperança, o outro é o desespero, que lobo ganha?

source: The one you feed."
pt_pt: Aquele que alimentas."

source: h: I was trying to <g id="1">starve</g> you, you sadistic ^asshole^!
pt_pt: h: Eu estava a tentar <g id="1">matar-te à fome</g> , seu ^cabrão^ sádico!

source: h: Screw it, I'll do positive affirmations instead.
pt_pt: h: Que se ^foda^, em vez disso vou fazer afirmações positivas.

source: h: <bx id="1"/>I am loved.
pt_pt: h: <bx id="1"/>Eu sou amado.

source: I am good.
pt_pt: Eu sou bom.

source: I am smart.
pt_pt: Eu sou inteligente.

source: I am beautiful.
pt_pt: Eu sou atraente.

source: I am special.
pt_pt: Eu sou especial.

source: Golly, that's so narcissistic!
pt_pt: Jesus, isso é tão narcisista!

source: Y'know affirmations were <g id="2">disproven?</g>
pt_pt: Sabes que as afirmações foram <g id="2">refutadas?</g>

source: omg don't credit random stories to indigenous folk
pt_pt: Omg não credites histórias aleatórias para povos indígenas

source: b: In fact, they actually <g id="1">backfire</g> for people with low self-esteem!
pt_pt: b: Na verdade, elas saem <g id="1">pela culatra</g> nas pessoas com baixa autoestima!

source: b: It was a well-designed study – randomized controlled trial, experimenter was blinded as to who was in which group.
pt_pt: b: Foi um estudo bem estruturado, um ensaio ao calhas controlado, o pesquisador não sabia quem em que grupo.

source: b: Results: if you already had low self-esteem, being asked to repeat affirmations makes you feel <g id="1">worse</g> than if you'd said nothing at all!
pt_pt: b: Resultados: se já tens baixa autoestima, pedir-te para repetir afirmações faz-te sentir <g id="1">pior</g> do que se não tivesses dito nada!

source: b: Wood 2009, Psychological Science.
pt_pt: b: Wood 2009, Ciência Psicológica.

source: Look it up on Google Scholar, human,
pt_pt: Procura no Google Acadêmico, humano,

source: b: THEN STOP SPREADING UNSCIENTIFIC FAKE NEWS
pt_pt: b: ENTÃO PARA DE DIVULGAR NOTÍCIAS NÃO CIENTÍFICAS FALSAS

source: b: You <g id="1">need</g> to humbly see your own flaws in order to grow as a person!
pt_pt: b: <g id="1">Precisas</g> de, humildemente, ver as tuas próprias falhas para crescer como pessoa!

source: b: You can't spray air freshener over a moldy room!
pt_pt: b: Você podes simplesmente borrifar spray aromático numa sala que cheira a mofo!

source: Covering up your flaws makes you worse in the long run.
pt_pt: Cobrir as tuas falhas torna-te pior a longo prazo.

source: b: Thankfully, I, as your loyal guard-wolf, can alert you to your flaws.
pt_pt: b: Felizmente, eu, como o teu Lobo de Guarda, posso alertar-te sobre as tuas falhas.

source: And right now, it's-
pt_pt: E agora, é-

source: b: EVERYTHING.
pt_pt: b: TUDO.

source: EVERYTHING IS WRONG
pt_pt: ESTÁ TUDO MAL

source: b: Native Americans are <g id="1">actual people</g>, not some "noble savages" you can namedrop to make your fortune-cookie advice more <g id="2">exotic</g>.
pt_pt: b: Os nativos americanos são <g id="1">pessoas reais</g> e não "selvagens nobres" que podes mencionar para tornar os teus conselhos mais <g id="2">exóticos</g>.

source: b: You're reducing individual persons & complex cultures to a Hallmark card!
pt_pt: b: Estás a reduzir pessoas individuais e culturas complexas a um cartão do Hallmark!

source: That's "benevolent racism"!
pt_pt: Isso é "racismo benevolente"!

source: b: STOP BEING RACIST YOU SQUINTY-EYED JERK
pt_pt: b: PARA DE SER RACISTA Ó IDIOTA ESTRÁBICO

source: h: ^ASSDAMMIT^.
pt_pt: h: ^CABRÃO^.

source: h: You know what?
pt_pt: h: Sabes que mais?

source: You're <g id="1">irrational</g>.
pt_pt: Tu és <g id="1">irracional</g>.

source: h: Everyone knows emotions are irrational!
pt_pt: h: Toda a gente sabe que as emoções são irracionais!

source: Especially fear!
pt_pt: Principalmente o medo!

source: h: You're a useless evolutionary leftover, like my appendix or wisdom teeth!
pt_pt: h: Não passas de restos evolutivos inúteis, como o apêndice ou os dentes do siso!

source: h: ^Hell^, this whole wolf metaphor is stupid!
pt_pt: h: ^Caralho^, toda essa metáfora do lobo é estúpida!

source: You're just a bunch of neuro-chemicals in my head.
pt_pt: És apenas um monte de neuro-químicos na minha cabeça.

source: h: So why should I listen to a worthless, irrational, non-existent piece of ^shit^ like you?!
pt_pt: h: Então, porque é que eu haveria de ouvir um pedaço de ^merda^ inútil, irracional e inexistente como tu?!

source: Jeez, human.
pt_pt: Jesus, humano.

source: That's really hurtful.
pt_pt: Isso é muito ofensivo.

source: I'm a feeling.
pt_pt: Eu sou um sentimento.

source: Feelings are valid.
pt_pt: Os sentimentos são válidos.

source: Human, we're <g id="2">both</g> "just chemicals."
pt_pt: Humano, nós <g id="2">os dois</g> somos "apenas químicos".

source: b: I'm <g id="1">part</g> of you, you know.
pt_pt: b: Eu sou <g id="1">parte</g> de ti, sabes?

source: When you say that, you're hurting <g id="2">yourself</g>.
pt_pt: Quando dizes isso, estás a magoar-te a <g id="2">ti próprio</g>.

source: b: Why are you hitting yourself, human?
pt_pt: b: Porque é que te estás a magoar, humano?

source: STOP HITTING YOURSELF.
pt_pt: PARA DE TE MAGOAR.
